GopalSaraf/Practicals/PSDL/include/proc/pic16f1827.inc
// Register: CLKRCON
#define CLKRCON CLKRCON
CLKRCON                                  equ 039Ah
// bitfield definitions
CLKRCON_CLKRDIV0_POSN                    equ 0000h
CLKRCON_CLKRDIV0_POSITION                equ 0000h
CLKRCON_CLKRDIV0_SIZE                    equ 0001h
CLKRCON_CLKRDIV0_LENGTH                  equ 0001h
CLKRCON_CLKRDIV0_MASK                    equ 0001h
CLKRCON_CLKRDIV1_POSN                    equ 0001h
CLKRCON_CLKRDIV1_POSITION                equ 0001h
CLKRCON_CLKRDIV1_SIZE                    equ 0001h
CLKRCON_CLKRDIV1_LENGTH                  equ 0001h
CLKRCON_CLKRDIV1_MASK                    equ 0002h
CLKRCON_CLKRDIV2_POSN                    equ 0002h
CLKRCON_CLKRDIV2_POSITION                equ 0002h
CLKRCON_CLKRDIV2_SIZE                    equ 0001h
CLKRCON_CLKRDIV2_LENGTH                  equ 0001h
CLKRCON_CLKRDIV2_MASK                    equ 0004h
CLKRCON_CLKRDC0_POSN                     equ 0003h
CLKRCON_CLKRDC0_POSITION                 equ 0003h
CLKRCON_CLKRDC0_SIZE                     equ 0001h
CLKRCON_CLKRDC0_LENGTH                   equ 0001h
CLKRCON_CLKRDC0_MASK                     equ 0008h
CLKRCON_CLKRDC1_POSN                     equ 0004h
CLKRCON_CLKRDC1_POSITION                 equ 0004h
CLKRCON_CLKRDC1_SIZE                     equ 0001h
CLKRCON_CLKRDC1_LENGTH                   equ 0001h
CLKRCON_CLKRDC1_MASK                     equ 0010h
CLKRCON_CLKRSLR_POSN                     equ 0005h
CLKRCON_CLKRSLR_POSITION                 equ 0005h
CLKRCON_CLKRSLR_SIZE                     equ 0001h
CLKRCON_CLKRSLR_LENGTH                   equ 0001h
CLKRCON_CLKRSLR_MASK                     equ 0020h
CLKRCON_CLKROE_POSN                      equ 0006h
CLKRCON_CLKROE_POSITION                  equ 0006h
CLKRCON_CLKROE_SIZE                      equ 0001h
CLKRCON_CLKROE_LENGTH                    equ 0001h
CLKRCON_CLKROE_MASK                      equ 0040h
CLKRCON_CLKREN_POSN                      equ 0007h
CLKRCON_CLKREN_POSITION                  equ 0007h
CLKRCON_CLKREN_SIZE                      equ 0001h
CLKRCON_CLKREN_LENGTH                    equ 0001h
CLKRCON_CLKREN_MASK                      equ 0080h
CLKRCON_CLKRDIV_POSN                     equ 0000h
CLKRCON_CLKRDIV_POSITION                 equ 0000h
CLKRCON_CLKRDIV_SIZE                     equ 0003h
CLKRCON_CLKRDIV_LENGTH                   equ 0003h
CLKRCON_CLKRDIV_MASK                     equ 0007h
CLKRCON_CLKRDC_POSN                      equ 0003h
CLKRCON_CLKRDC_POSITION                  equ 0003h
CLKRCON_CLKRDC_SIZE                      equ 0002h
CLKRCON_CLKRDC_LENGTH                    equ 0002h
CLKRCON_CLKRDC_MASK                      equ 0018h

// Register: MDCON
#define MDCON MDCON
MDCON                                    equ 039Ch
// bitfield definitions
MDCON_MDBIT_POSN                         equ 0000h
MDCON_MDBIT_POSITION                     equ 0000h
MDCON_MDBIT_SIZE                         equ 0001h
MDCON_MDBIT_LENGTH                       equ 0001h
MDCON_MDBIT_MASK                         equ 0001h
MDCON_MDOUT_POSN                         equ 0003h
MDCON_MDOUT_POSITION                     equ 0003h
MDCON_MDOUT_SIZE                         equ 0001h
MDCON_MDOUT_LENGTH                       equ 0001h
MDCON_MDOUT_MASK                         equ 0008h
MDCON_MDOPOL_POSN                        equ 0004h
MDCON_MDOPOL_POSITION                    equ 0004h
MDCON_MDOPOL_SIZE                        equ 0001h
MDCON_MDOPOL_LENGTH                      equ 0001h
MDCON_MDOPOL_MASK                        equ 0010h
MDCON_MDSLR_POSN                         equ 0005h
MDCON_MDSLR_POSITION                     equ 0005h
MDCON_MDSLR_SIZE                         equ 0001h
MDCON_MDSLR_LENGTH                       equ 0001h
MDCON_MDSLR_MASK                         equ 0020h
MDCON_MDOE_POSN                          equ 0006h
MDCON_MDOE_POSITION                      equ 0006h
MDCON_MDOE_SIZE                          equ 0001h
MDCON_MDOE_LENGTH                        equ 0001h
MDCON_MDOE_MASK                          equ 0040h
MDCON_MDEN_POSN                          equ 0007h
MDCON_MDEN_POSITION                      equ 0007h
MDCON_MDEN_SIZE                          equ 0001h
MDCON_MDEN_LENGTH                        equ 0001h
MDCON_MDEN_MASK                          equ 0080h

// Register: MDSRC
#define MDSRC MDSRC
MDSRC                                    equ 039Dh
// bitfield definitions
MDSRC_MDMS0_POSN                         equ 0000h
MDSRC_MDMS0_POSITION                     equ 0000h
MDSRC_MDMS0_SIZE                         equ 0001h
MDSRC_MDMS0_LENGTH                       equ 0001h
MDSRC_MDMS0_MASK                         equ 0001h
MDSRC_MDMS1_POSN                         equ 0001h
MDSRC_MDMS1_POSITION                     equ 0001h
MDSRC_MDMS1_SIZE                         equ 0001h
MDSRC_MDMS1_LENGTH                       equ 0001h
MDSRC_MDMS1_MASK                         equ 0002h
MDSRC_MDMS2_POSN                         equ 0002h
MDSRC_MDMS2_POSITION                     equ 0002h
MDSRC_MDMS2_SIZE                         equ 0001h
MDSRC_MDMS2_LENGTH                       equ 0001h
MDSRC_MDMS2_MASK                         equ 0004h
MDSRC_MDMS3_POSN                         equ 0003h
MDSRC_MDMS3_POSITION                     equ 0003h
MDSRC_MDMS3_SIZE                         equ 0001h
MDSRC_MDMS3_LENGTH                       equ 0001h
MDSRC_MDMS3_MASK                         equ 0008h
MDSRC_MDMSODIS_POSN                      equ 0007h
MDSRC_MDMSODIS_POSITION                  equ 0007h
MDSRC_MDMSODIS_SIZE                      equ 0001h
MDSRC_MDMSODIS_LENGTH                    equ 0001h
MDSRC_MDMSODIS_MASK                      equ 0080h
MDSRC_MDMS_POSN                          equ 0000h
MDSRC_MDMS_POSITION                      equ 0000h
MDSRC_MDMS_SIZE                          equ 0004h
MDSRC_MDMS_LENGTH                        equ 0004h
MDSRC_MDMS_MASK                          equ 000Fh

// Register: MDCARL
#define MDCARL MDCARL
MDCARL                                   equ 039Eh
// bitfield definitions
MDCARL_MDCL0_POSN                        equ 0000h
MDCARL_MDCL0_POSITION                    equ 0000h
MDCARL_MDCL0_SIZE                        equ 0001h
MDCARL_MDCL0_LENGTH                      equ 0001h
MDCARL_MDCL0_MASK                        equ 0001h
MDCARL_MDCL1_POSN                        equ 0001h
MDCARL_MDCL1_POSITION                    equ 0001h
MDCARL_MDCL1_SIZE                        equ 0001h
MDCARL_MDCL1_LENGTH                      equ 0001h
MDCARL_MDCL1_MASK                        equ 0002h
MDCARL_MDCL2_POSN                        equ 0002h
MDCARL_MDCL2_POSITION                    equ 0002h
MDCARL_MDCL2_SIZE                        equ 0001h
MDCARL_MDCL2_LENGTH                      equ 0001h
MDCARL_MDCL2_MASK                        equ 0004h
MDCARL_MDCL3_POSN                        equ 0003h
MDCARL_MDCL3_POSITION                    equ 0003h
MDCARL_MDCL3_SIZE                        equ 0001h
MDCARL_MDCL3_LENGTH                      equ 0001h
MDCARL_MDCL3_MASK                        equ 0008h
MDCARL_MDCLSYNC_POSN                     equ 0005h
MDCARL_MDCLSYNC_POSITION                 equ 0005h
MDCARL_MDCLSYNC_SIZE                     equ 0001h
MDCARL_MDCLSYNC_LENGTH                   equ 0001h
MDCARL_MDCLSYNC_MASK                     equ 0020h
MDCARL_MDCLPOL_POSN                      equ 0006h
MDCARL_MDCLPOL_POSITION                  equ 0006h
MDCARL_MDCLPOL_SIZE                      equ 0001h
MDCARL_MDCLPOL_LENGTH                    equ 0001h
MDCARL_MDCLPOL_MASK                      equ 0040h
MDCARL_MDCLODIS_POSN                     equ 0007h
MDCARL_MDCLODIS_POSITION                 equ 0007h
MDCARL_MDCLODIS_SIZE                     equ 0001h
MDCARL_MDCLODIS_LENGTH                   equ 0001h
MDCARL_MDCLODIS_MASK                     equ 0080h
MDCARL_MDCL_POSN                         equ 0000h
MDCARL_MDCL_POSITION                     equ 0000h
MDCARL_MDCL_SIZE                         equ 0004h
MDCARL_MDCL_LENGTH                       equ 0004h
MDCARL_MDCL_MASK                         equ 000Fh

// Register: MDCARH
#define MDCARH MDCARH
MDCARH                                   equ 039Fh
// bitfield definitions
MDCARH_MDCH0_POSN                        equ 0000h
MDCARH_MDCH0_POSITION                    equ 0000h
MDCARH_MDCH0_SIZE                        equ 0001h
MDCARH_MDCH0_LENGTH                      equ 0001h
MDCARH_MDCH0_MASK                        equ 0001h
MDCARH_MDCH1_POSN                        equ 0001h
MDCARH_MDCH1_POSITION                    equ 0001h
MDCARH_MDCH1_SIZE                        equ 0001h
MDCARH_MDCH1_LENGTH                      equ 0001h
MDCARH_MDCH1_MASK                        equ 0002h
MDCARH_MDCH2_POSN                        equ 0002h
MDCARH_MDCH2_POSITION                    equ 0002h
MDCARH_MDCH2_SIZE                        equ 0001h
MDCARH_MDCH2_LENGTH                      equ 0001h
MDCARH_MDCH2_MASK                        equ 0004h
MDCARH_MDCH3_POSN                        equ 0003h
MDCARH_MDCH3_POSITION                    equ 0003h
MDCARH_MDCH3_SIZE                        equ 0001h
MDCARH_MDCH3_LENGTH                      equ 0001h
MDCARH_MDCH3_MASK                        equ 0008h
MDCARH_MDCHSYNC_POSN                     equ 0005h
MDCARH_MDCHSYNC_POSITION                 equ 0005h
MDCARH_MDCHSYNC_SIZE                     equ 0001h
MDCARH_MDCHSYNC_LENGTH                   equ 0001h
MDCARH_MDCHSYNC_MASK                     equ 0020h
MDCARH_MDCHPOL_POSN                      equ 0006h
MDCARH_MDCHPOL_POSITION                  equ 0006h
MDCARH_MDCHPOL_SIZE                      equ 0001h
MDCARH_MDCHPOL_LENGTH                    equ 0001h
MDCARH_MDCHPOL_MASK                      equ 0040h
MDCARH_MDCHODIS_POSN                     equ 0007h
MDCARH_MDCHODIS_POSITION                 equ 0007h
MDCARH_MDCHODIS_SIZE                     equ 0001h
MDCARH_MDCHODIS_LENGTH                   equ 0001h
MDCARH_MDCHODIS_MASK                     equ 0080h
MDCARH_MDCH_POSN                         equ 0000h
MDCARH_MDCH_POSITION                     equ 0000h
MDCARH_MDCH_SIZE                         equ 0004h
MDCARH_MDCH_LENGTH                       equ 0004h
MDCARH_MDCH_MASK                         equ 000Fh

// Register: TMR4
#define TMR4 TMR4
TMR4                                     equ 0415h
// bitfield definitions
TMR4_TMR4_POSN                           equ 0000h
TMR4_TMR4_POSITION                       equ 0000h
TMR4_TMR4_SIZE                           equ 0008h
TMR4_TMR4_LENGTH                         equ 0008h
TMR4_TMR4_MASK                           equ 00FFh

// Register: PR4
#define PR4 PR4
PR4                                      equ 0416h
// bitfield definitions
PR4_PR4_POSN                             equ 0000h
PR4_PR4_POSITION                         equ 0000h
PR4_PR4_SIZE                             equ 0008h
PR4_PR4_LENGTH                           equ 0008h
PR4_PR4_MASK                             equ 00FFh

// Register: T4CON
#define T4CON T4CON
T4CON                                    equ 0417h
// bitfield definitions
T4CON_T4CKPS0_POSN                       equ 0000h
T4CON_T4CKPS0_POSITION                   equ 0000h
T4CON_T4CKPS0_SIZE                       equ 0001h
T4CON_T4CKPS0_LENGTH                     equ 0001h
T4CON_T4CKPS0_MASK                       equ 0001h
T4CON_T4CKPS1_POSN                       equ 0001h
T4CON_T4CKPS1_POSITION                   equ 0001h
T4CON_T4CKPS1_SIZE                       equ 0001h
T4CON_T4CKPS1_LENGTH                     equ 0001h
T4CON_T4CKPS1_MASK                       equ 0002h
T4CON_TMR4ON_POSN                        equ 0002h
T4CON_TMR4ON_POSITION                    equ 0002h
T4CON_TMR4ON_SIZE                        equ 0001h
T4CON_TMR4ON_LENGTH                      equ 0001h
T4CON_TMR4ON_MASK                        equ 0004h
T4CON_T4OUTPS0_POSN                      equ 0003h
T4CON_T4OUTPS0_POSITION                  equ 0003h
T4CON_T4OUTPS0_SIZE                      equ 0001h
T4CON_T4OUTPS0_LENGTH                    equ 0001h
T4CON_T4OUTPS0_MASK                      equ 0008h
T4CON_T4OUTPS1_POSN                      equ 0004h
T4CON_T4OUTPS1_POSITION                  equ 0004h
T4CON_T4OUTPS1_SIZE                      equ 0001h
T4CON_T4OUTPS1_LENGTH                    equ 0001h
T4CON_T4OUTPS1_MASK                      equ 0010h
T4CON_T4OUTPS2_POSN                      equ 0005h
T4CON_T4OUTPS2_POSITION                  equ 0005h
T4CON_T4OUTPS2_SIZE                      equ 0001h
T4CON_T4OUTPS2_LENGTH                    equ 0001h
T4CON_T4OUTPS2_MASK                      equ 0020h
T4CON_T4OUTPS3_POSN                      equ 0006h
T4CON_T4OUTPS3_POSITION                  equ 0006h
T4CON_T4OUTPS3_SIZE                      equ 0001h
T4CON_T4OUTPS3_LENGTH                    equ 0001h
T4CON_T4OUTPS3_MASK                      equ 0040h
T4CON_T4CKPS_POSN                        equ 0000h
T4CON_T4CKPS_POSITION                    equ 0000h
T4CON_T4CKPS_SIZE                        equ 0002h
T4CON_T4CKPS_LENGTH                      equ 0002h
T4CON_T4CKPS_MASK                        equ 0003h
T4CON_T4OUTPS_POSN                       equ 0003h
T4CON_T4OUTPS_POSITION                   equ 0003h
T4CON_T4OUTPS_SIZE                       equ 0004h
T4CON_T4OUTPS_LENGTH                     equ 0004h
T4CON_T4OUTPS_MASK                       equ 0078h

// Register: TMR6
#define TMR6 TMR6
TMR6                                     equ 041Ch
// bitfield definitions
TMR6_TMR6_POSN                           equ 0000h
TMR6_TMR6_POSITION                       equ 0000h
TMR6_TMR6_SIZE                           equ 0008h
TMR6_TMR6_LENGTH                         equ 0008h
TMR6_TMR6_MASK                           equ 00FFh

// Register: PR6
#define PR6 PR6
PR6                                      equ 041Dh
// bitfield definitions
PR6_PR6_POSN                             equ 0000h
PR6_PR6_POSITION                         equ 0000h
PR6_PR6_SIZE                             equ 0008h
PR6_PR6_LENGTH                           equ 0008h
PR6_PR6_MASK                             equ 00FFh

// Register: T6CON
#define T6CON T6CON
T6CON                                    equ 041Eh
// bitfield definitions
T6CON_T6CKPS0_POSN                       equ 0000h
T6CON_T6CKPS0_POSITION                   equ 0000h
T6CON_T6CKPS0_SIZE                       equ 0001h
T6CON_T6CKPS0_LENGTH                     equ 0001h
T6CON_T6CKPS0_MASK                       equ 0001h
T6CON_T6CKPS1_POSN                       equ 0001h
T6CON_T6CKPS1_POSITION                   equ 0001h
T6CON_T6CKPS1_SIZE                       equ 0001h
T6CON_T6CKPS1_LENGTH                     equ 0001h
T6CON_T6CKPS1_MASK                       equ 0002h
T6CON_TMR6ON_POSN                        equ 0002h
T6CON_TMR6ON_POSITION                    equ 0002h
T6CON_TMR6ON_SIZE                        equ 0001h
T6CON_TMR6ON_LENGTH                      equ 0001h
T6CON_TMR6ON_MASK                        equ 0004h
T6CON_T6OUTPS0_POSN                      equ 0003h
T6CON_T6OUTPS0_POSITION                  equ 0003h
T6CON_T6OUTPS0_SIZE                      equ 0001h
T6CON_T6OUTPS0_LENGTH                    equ 0001h
T6CON_T6OUTPS0_MASK                      equ 0008h
T6CON_T6OUTPS1_POSN                      equ 0004h
T6CON_T6OUTPS1_POSITION                  equ 0004h
T6CON_T6OUTPS1_SIZE                      equ 0001h
T6CON_T6OUTPS1_LENGTH                    equ 0001h
T6CON_T6OUTPS1_MASK                      equ 0010h
T6CON_T6OUTPS2_POSN                      equ 0005h
T6CON_T6OUTPS2_POSITION                  equ 0005h
T6CON_T6OUTPS2_SIZE                      equ 0001h
T6CON_T6OUTPS2_LENGTH                    equ 0001h
T6CON_T6OUTPS2_MASK                      equ 0020h
T6CON_T6OUTPS3_POSN                      equ 0006h
T6CON_T6OUTPS3_POSITION                  equ 0006h
T6CON_T6OUTPS3_SIZE                      equ 0001h
T6CON_T6OUTPS3_LENGTH                    equ 0001h
T6CON_T6OUTPS3_MASK                      equ 0040h
T6CON_T6CKPS_POSN                        equ 0000h
T6CON_T6CKPS_POSITION                    equ 0000h
T6CON_T6CKPS_SIZE                        equ 0002h
T6CON_T6CKPS_LENGTH                      equ 0002h
T6CON_T6CKPS_MASK                        equ 0003h
T6CON_T6OUTPS_POSN                       equ 0003h
T6CON_T6OUTPS_POSITION                   equ 0003h
T6CON_T6OUTPS_SIZE                       equ 0004h
T6CON_T6OUTPS_LENGTH                     equ 0004h
T6CON_T6OUTPS_MASK                       equ 0078h

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 0FE4h
// bitfield definitions
STATUS_SHAD_C_SHAD_POSN                  equ 0000h
STATUS_SHAD_C_SHAD_POSITION              equ 0000h
STATUS_SHAD_C_SHAD_SIZE                  equ 0001h
STATUS_SHAD_C_SHAD_LENGTH                equ 0001h
STATUS_SHAD_C_SHAD_MASK                  equ 0001h
STATUS_SHAD_DC_SHAD_POSN                 equ 0001h
STATUS_SHAD_DC_SHAD_POSITION             equ 0001h
STATUS_SHAD_DC_SHAD_SIZE                 equ 0001h
STATUS_SHAD_DC_SHAD_LENGTH               equ 0001h
STATUS_SHAD_DC_SHAD_MASK                 equ 0002h
STATUS_SHAD_Z_SHAD_POSN                  equ 0002h
STATUS_SHAD_Z_SHAD_POSITION              equ 0002h
STATUS_SHAD_Z_SHAD_SIZE                  equ 0001h
STATUS_SHAD_Z_SHAD_LENGTH                equ 0001h
STATUS_SHAD_Z_SHAD_MASK                  equ 0004h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 0FE5h
// bitfield definitions
WREG_SHAD_WREG_SHAD_POSN                 equ 0000h
WREG_SHAD_WREG_SHAD_POSITION             equ 0000h
WREG_SHAD_WREG_SHAD_SIZE                 equ 0008h
WREG_SHAD_WREG_SHAD_LENGTH               equ 0008h
WREG_SHAD_WREG_SHAD_MASK                 equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 0FE6h
// bitfield definitions
BSR_SHAD_BSR_SHAD_POSN                   equ 0000h
BSR_SHAD_BSR_SHAD_POSITION               equ 0000h
BSR_SHAD_BSR_SHAD_SIZE                   equ 0005h
BSR_SHAD_BSR_SHAD_LENGTH                 equ 0005h
BSR_SHAD_BSR_SHAD_MASK                   equ 001Fh

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 0FE7h
// bitfield definitions
PCLATH_SHAD_PCLATH_SHAD_POSN             equ 0000h
PCLATH_SHAD_PCLATH_SHAD_POSITION         equ 0000h
PCLATH_SHAD_PCLATH_SHAD_SIZE             equ 0007h
PCLATH_SHAD_PCLATH_SHAD_LENGTH           equ 0007h
PCLATH_SHAD_PCLATH_SHAD_MASK             equ 007Fh

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 0FE8h
// bitfield definitions
FSR0L_SHAD_FSR0L_SHAD_POSN               equ 0000h
FSR0L_SHAD_FSR0L_SHAD_POSITION           equ 0000h
FSR0L_SHAD_FSR0L_SHAD_SIZE               equ 0008h
FSR0L_SHAD_FSR0L_SHAD_LENGTH             equ 0008h
FSR0L_SHAD_FSR0L_SHAD_MASK               equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 0FE9h
// bitfield definitions
FSR0H_SHAD_FSR0H_SHAD_POSN               equ 0000h
FSR0H_SHAD_FSR0H_SHAD_POSITION           equ 0000h
FSR0H_SHAD_FSR0H_SHAD_SIZE               equ 0008h
FSR0H_SHAD_FSR0H_SHAD_LENGTH             equ 0008h
FSR0H_SHAD_FSR0H_SHAD_MASK               equ 00FFh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 0FEAh
// bitfield definitions
FSR1L_SHAD_FSR1L_SHAD_POSN               equ 0000h
FSR1L_SHAD_FSR1L_SHAD_POSITION           equ 0000h
FSR1L_SHAD_FSR1L_SHAD_SIZE               equ 0008h
FSR1L_SHAD_FSR1L_SHAD_LENGTH             equ 0008h
FSR1L_SHAD_FSR1L_SHAD_MASK               equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 0FEBh
// bitfield definitions
FSR1H_SHAD_FSR1H_SHAD_POSN               equ 0000h
FSR1H_SHAD_FSR1H_SHAD_POSITION           equ 0000h
FSR1H_SHAD_FSR1H_SHAD_SIZE               equ 0008h
FSR1H_SHAD_FSR1H_SHAD_LENGTH             equ 0008h
FSR1H_SHAD_FSR1H_SHAD_MASK               equ 00FFh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FEDh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh

